In [1]:
import pandas as pd
import numpy as np

Загрузим данные

In [36]:
train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")

train_size = train.shape[0]

# extract label column before concatenating train and test
labels = train["Survived"]
train.drop(["Survived", "PassengerId"], axis=1, inplace=True)
test.drop(["PassengerId"], axis=1, inplace=True)

In [37]:
train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Заменим строковые фичи на числовые

In [38]:
from sklearn.preprocessing import LabelEncoder

# concat train and test
all = pd.concat([train, test])

categorial = ["Name", "Sex", "Ticket", "Cabin", "Embarked"]

for col in categorial:
    le = LabelEncoder()
    all[col] = le.fit_transform(all[col].fillna("0"))

# split all into train and test

train = all.iloc[:train_size]
test = all.iloc[train_size:]

In [39]:
train.head()

   Pclass  Name  Sex   Age  SibSp  Parch  Ticket     Fare  Cabin  Embarked
0       3   155    1  22.0      1      0     720   7.2500      0         3
1       1   286    0  38.0      1      0     816  71.2833    107         1
2       3   523    0  26.0      0      0     914   7.9250      0         3
3       1   422    0  35.0      1      0      65  53.1000     71         3
4       3    22    1  35.0      0      0     649   8.0500      0         3

Заполним пропуски в данных

In [40]:
train.fillna(0, inplace=True)
test.fillna(0, inplace=True)

C:\Users\Evgenii\AppData\Local\Programs\Python\Python36-32\lib\site-packages\pandas\core\frame.py:3035: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  downcast=downcast, **kwargs)

Обучим наивного байеса и сделаем предсказания для теста

In [41]:
from sklearn.naive_bayes import GaussianNB

clf = GaussianNB()
clf.fit(train, labels)
test_predictions = clf.predict(test)

Сформируем файл с посылкой. Для этого загрузим gender_submission и заменим колонку Survived своими предсказаниями

In [42]:
submission = pd.read_csv("gender_submission.csv")
submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [43]:
submission["Survived"] = test_predictions
submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0

In [44]:
submission.to_csv("my_first_submission.csv", index=False)

Скор 0.73 и почетное 8908 место наше!